# Movies Tonight Part 4: A few SELECT queries 
__Use `%%sql` magic to write the queries listed below.__

In [7]:
# load %sql magic extension
%load_ext sql

# initialize a database connection; may have to adjust username and password 
%sql sqlite:///Movies.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @Movies.db'

**1. Write a select query that returns the MovieTitle, TheaterName, and Showtime for each movie showing.**  
The query should use `JOIN` syntax as described in your textbook. Also, use aliases ( `… AS …` ) to make sure that column names match exactly what is asked for.

In [15]:
%%sql
SELECT MTitle AS MovieTitle, TName AS TheaterName, STime AS ShowTime
FROM MOVIES
JOIN SHOWS ON MOVIES.MID = SHOWS.SID
JOIN THEATERS ON THEATERS.TID = SHOWS.TID
LIMIT 10;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('Independence Day', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('D3: The Mighty Ducks', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('Dear God', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('First Wives Club, The', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('High School High', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('Larger Than Life', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('Mirror Has Two Faces, The', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Ransom', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM')]

**2. Write a select query to display the MovieTitle, TheaterName, and Showtime for each show after 7pm.** You can start with a copy of the previous query and then add a `WHERE` clause.

In [16]:
%%sql
SELECT MTitle AS MovieTitle, TName AS TheaterName, STime AS ShowTime
FROM MOVIES
JOIN SHOWS ON MOVIES.MID = SHOWS.SID
JOIN THEATERS ON THEATERS.TID = SHOWS.TID
WHERE STime > 7
LIMIT 10;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Mirror Has Two Faces, The', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Ransom', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Sleepers', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Space Jam', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ("Stephen King's Thinner", 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Michael Collins', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Romeo & Juliet', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Big Night', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('Fly Away Home', 'Akarakian Theatres Moreno 4 Cinemas', '9:40 PM'),
 ('Nutty Professor, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:40 PM')]

**3. Write a select query to display the cast (actors only) of each movie.** The query should return the Movie Title, Actor Name, MID, and AID.

In [19]:
%%sql
SELECT MTitle AS MovieTitle, AName AS ActorName, MOVIES.MID, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
LIMIT 10;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Associate, The', 'Austin Pendleton', 1, 1),
 ('Associate, The', 'Austin Pendleton', 24, 1),
 ('Associate, The', 'Austin Pendleton', 47, 1),
 ('Associate, The', 'Bebe Neuwirth', 1, 2),
 ('Associate, The', 'Bebe Neuwirth', 24, 2),
 ('Associate, The', 'Bebe Neuwirth', 47, 2),
 ('Associate, The', 'Dianne Wiest', 1, 3),
 ('Associate, The', 'Dianne Wiest', 24, 3),
 ('Associate, The', 'Dianne Wiest', 47, 3),
 ('Associate, The', 'Eli Wallach', 1, 4)]

**4. Write a select query to display the number of distinct movies that each actor appears in.** The query should return the ActorName, MovieCount, and AID. You will need to use use a GROUP BY clause and the COUNT() function.

In [20]:
%%sql
SELECT AName AS ActorName, COUNT(ARTISTS.AID) AS MovieCount, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
GROUP BY ARTISTS.AName
ORDER BY COUNT(ARTISTS.AID)
DESC
LIMIT 10;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Bill Murray', 72, 53),
 ('Diane Venora', 72, 100),
 ('Jada Pinkett', 72, 117),
 ('Minnie Driver', 72, 77),
 ('Vivica Fox', 72, 28),
 ('Aidan Quinn', 36, 93),
 ('Alan Rickman', 36, 94),
 ('Anna Paquin', 36, 111),
 ('Anthony Hopkins', 36, 132),
 ('Austin Pendleton', 36, 1)]

**5. Write a select query to display only the actors that appear in multiple movies.** The query should return the Actor Name, Movie Count, and AID. You can use the previous select query as a starting point. You will need to add a HAVING clause to do the restriction.

In [22]:
%%sql
SELECT AName AS ActorName, COUNT(ARTISTS.AID) AS MovieCount, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
GROUP BY ARTISTS.AName
HAVING COUNT(ARTISTS.AID) > 1
ORDER BY COUNT(ARTISTS.AID)
DESC
LIMIT 10;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Bill Murray', 72, 53),
 ('Diane Venora', 72, 100),
 ('Jada Pinkett', 72, 117),
 ('Minnie Driver', 72, 77),
 ('Vivica Fox', 72, 28),
 ('Aidan Quinn', 36, 93),
 ('Alan Rickman', 36, 94),
 ('Anna Paquin', 36, 111),
 ('Anthony Hopkins', 36, 132),
 ('Austin Pendleton', 36, 1)]

**6. Write a select query to display directors that also act in their movies.** The query should return the ArtistName, NumDirectorCredits, NumActorCredits, NumDirectorActorCredits. Each count should be calculated separately using a subquery. Note: NumDirectorActorCredits should be greater than 0.

In [45]:
%%sql
SELECT AName AS ArtistName,  
COUNT((SELECT CCode FROM CREDITS WHERE CCode = "D")) AS NumDirectorCredits, 
COUNT((SELECT CCode FROM CREDITS WHERE CCode = "A")) AS NumActorCredits,
COUNT((SELECT CCode FROM CREDITS)) AS NumDirectorActorCredits
FROM MOVIES
JOIN CREDITS USING (MID)
JOIN ARTISTS USING (AID)
GROUP BY AName
HAVING NumDirectorActorCredits !=1
AND
NumDirectorCredits !=0
LIMIT 10;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Aidan Quinn', 36, 36, 36),
 ('Alan Rickman', 36, 36, 36),
 ('Anna Paquin', 36, 36, 36),
 ('Anthony Hopkins', 36, 36, 36),
 ('Arlene Sanford', 36, 36, 36),
 ('Austin Pendleton', 36, 36, 36),
 ('Barbra Streisand', 72, 72, 72),
 ('Barry Levinson', 36, 36, 36),
 ('Baz Luhrmann', 36, 36, 36),
 ('Bebe Neuwirth', 36, 36, 36)]

Sean Bernard